CD2DResource.m_pParentTarget
Pointer to the parent CRenderTarget)

CD2DResource.m_bIsAutoDestroy
Resource will be destroyed by owner (CRenderTarget)

CD2DResource.IsValid
Checks resource validity
Returns:
TRUE if resource is valid; otherwise FALSE.

CD2DResource.Destroy
Destroys a CD2DResource object.

CD2DResource.Create(CRenderTarget*)
Creates a CD2DResource.
Returns:
If the method succeeds, it returns S_OK. Otherwise, it returns an HRESULT error code.
pRenderTarget: A pointer to the render target.

CD2DResource.ReCreate(CRenderTarget*)
Re-creates a CD2DResource.
Returns:
If the method succeeds, it returns S_OK. Otherwise, it returns an HRESULT error code.
pRenderTarget: A pointer to the render target.

CD2DResource.IsAutoDestroy
Check auto destroy flag.
Returns:
TRUE if the object will be destroyed by its owner; otherwise FALSE.

CD2DResource.Dispose
The destructor. Called when a D2D resource object is being destroyed.

CD2DResource.#ctor(CRenderTarget*,System.Int32)
Constructs a CD2DResource object.
pParentTarget: A pointer to the render target.
bAutoDestroy: Indicates that the object will be destroyed by owner (pParentTarget).

CD2DResource
An abstract class, which provides a interface for creating and managing D2D resources such as brushes, layers and texts.